zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_RADIO_CTRL.h
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PR2IPS_STATUS_MASK (0x30000U)
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PR2IPS_STATUS_SHIFT (16U)
/*! PR2IPS_STATUS - PR2IPS_STATUS */
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PR2IPS_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PR2IPS_STATUS_SHIFT)) & RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PR2IPS_STATUS_MASK)

#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_TIMEOUT_VAL_MASK (0x7C0000U)
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_TIMEOUT_VAL_SHIFT (18U)
/*! PREFETCH_TIMEOUT_VAL - IPS Prefetch timeout value */
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_TIMEOUT_VAL(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_TIMEOUT_VAL_SHIFT)) & RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_TIMEOUT_VAL_MASK)

#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_MODULE_EN_MASK (0xFF800000U)
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_MODULE_EN_SHIFT (23U)
/*! PREFETCH_MODULE_EN - Prefetch module enable
 *  0b1xxxxxxxx..prefetch_module_en[8] : RX packet RAM
 *  0bx1xxxxxxx..prefetch_module_en[7] : TX packet RAM
 *  0bxx1xxxxxx..prefetch_module_en[6] : XCVR registers
 *  0bxxx1xxxxx..prefetch_module_en[5] : RF_CTRL registers (rf_ctrl, wor, bme,sfa, bric, ltc registers)
 *  0bxxxx1xxxx..prefetch_module_en[4] : Generic LL Remap2
 *  0bxxxxx1xxx..prefetch_module_en[3] : Generic LL Remap1
 *  0bxxxxxx1xx..prefetch_module_en[2] : Generic LL Remap0
 *  0bxxxxxxx1x..prefetch_module_en[1] : Generic LL
 *  0bxxxxxxxx1..prefetch_module_en[0]: : Zigbee
 */
#define RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_MODULE_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_MODULE_EN_SHIFT)) & RADIO_CTRL_PACKET_RAM_TO_IPS_CTRL_PREFETCH_MODULE_EN_MASK)
/*! @} */

/*! @name BLE_AUTOLOAD - NBU autoload mode value */
/*! @{ */

#define RADIO_CTRL_BLE_AUTOLOAD_BLE_AUTOLOAD_CNT_VAL_MASK (0xFU)
#define RADIO_CTRL_BLE_AUTOLOAD_BLE_AUTOLOAD_CNT_VAL_SHIFT (0U)
/*! BLE_AUTOLOAD_CNT_VAL - BLE_AUTOLOAD_CNT_VAL */
#define RADIO_CTRL_BLE_AUTOLOAD_BLE_AUTOLOAD_CNT_VAL(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_BLE_AUTOLOAD_BLE_AUTOLOAD_CNT_VAL_SHIFT)) & RADIO_CTRL_BLE_AUTOLOAD_BLE_AUTOLOAD_CNT_VAL_MASK)
/*! @} */

/*! @name RF_RST_CTRL - Radio Reset Control Register */
/*! @{ */

#define RADIO_CTRL_RF_RST_CTRL_LIF_XCVR_RST_MASK (0x1U)
#define RADIO_CTRL_RF_RST_CTRL_LIF_XCVR_RST_SHIFT (0U)
/*! LIF_XCVR_RST - LIF_XCVR reset control */
#define RADIO_CTRL_RF_RST_CTRL_LIF_XCVR_RST(x)   (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_LIF_XCVR_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_LIF_XCVR_RST_MASK)

#define RADIO_CTRL_RF_RST_CTRL_RBME_RST_MASK     (0x2U)
#define RADIO_CTRL_RF_RST_CTRL_RBME_RST_SHIFT    (1U)
/*! RBME_RST - RBME reset control */
#define RADIO_CTRL_RF_RST_CTRL_RBME_RST(x)       (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_RBME_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_RBME_RST_MASK)

#define RADIO_CTRL_RF_RST_CTRL_ZBLL_RST_MASK     (0x4U)
#define RADIO_CTRL_RF_RST_CTRL_ZBLL_RST_SHIFT    (2U)
/*! ZBLL_RST - 15.4 MAC reset control */
#define RADIO_CTRL_RF_RST_CTRL_ZBLL_RST(x)       (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_ZBLL_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_ZBLL_RST_MASK)

#define RADIO_CTRL_RF_RST_CTRL_GENLL_RST_MASK    (0x8U)
#define RADIO_CTRL_RF_RST_CTRL_GENLL_RST_SHIFT   (3U)
/*! GENLL_RST - GENLL reset control */
#define RADIO_CTRL_RF_RST_CTRL_GENLL_RST(x)      (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_GENLL_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_GENLL_RST_MASK)

#define RADIO_CTRL_RF_RST_CTRL_BRIC_RST_MASK     (0x10U)
#define RADIO_CTRL_RF_RST_CTRL_BRIC_RST_SHIFT    (4U)
/*! BRIC_RST - BRIC reset control */
#define RADIO_CTRL_RF_RST_CTRL_BRIC_RST(x)       (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_BRIC_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_BRIC_RST_MASK)

#define RADIO_CTRL_RF_RST_CTRL_WOR_RST_MASK      (0x20U)
#define RADIO_CTRL_RF_RST_CTRL_WOR_RST_SHIFT     (5U)
/*! WOR_RST - WOR reset control */
#define RADIO_CTRL_RF_RST_CTRL_WOR_RST(x)        (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_RST_CTRL_WOR_RST_SHIFT)) & RADIO_CTRL_RF_RST_CTRL_WOR_RST_MASK)
/*! @} */

/*! @name NCO32K_CTRL - NCO32K Control */
/*! @{ */

#define RADIO_CTRL_NCO32K_CTRL_EN_MASK           (0x1U)
#define RADIO_CTRL_NCO32K_CTRL_EN_SHIFT          (0U)
/*! EN - NCO32K enable bit */
#define RADIO_CTRL_NCO32K_CTRL_EN(x)             (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_CTRL_EN_SHIFT)) & RADIO_CTRL_NCO32K_CTRL_EN_MASK)

#define RADIO_CTRL_NCO32K_CTRL_FREQ_SEL_MASK     (0x2U)
#define RADIO_CTRL_NCO32K_CTRL_FREQ_SEL_SHIFT    (1U)
/*! FREQ_SEL - Select NCO32K frequency output */
#define RADIO_CTRL_NCO32K_CTRL_FREQ_SEL(x)       (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_CTRL_FREQ_SEL_SHIFT)) & RADIO_CTRL_NCO32K_CTRL_FREQ_SEL_MASK)

#define RADIO_CTRL_NCO32K_CTRL_PHASE_STEP_MASK   (0xF0U)
#define RADIO_CTRL_NCO32K_CTRL_PHASE_STEP_SHIFT  (4U)
/*! PHASE_STEP - Autorized phase steps during clock alignement at NCO32K shutdown */
#define RADIO_CTRL_NCO32K_CTRL_PHASE_STEP(x)     (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_CTRL_PHASE_STEP_SHIFT)) & RADIO_CTRL_NCO32K_CTRL_PHASE_STEP_MASK)

#define RADIO_CTRL_NCO32K_CTRL_SPARE_MASK        (0xF00U)
#define RADIO_CTRL_NCO32K_CTRL_SPARE_SHIFT       (8U)
/*! SPARE - Spare */
#define RADIO_CTRL_NCO32K_CTRL_SPARE(x)          (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_CTRL_SPARE_SHIFT)) & RADIO_CTRL_NCO32K_CTRL_SPARE_MASK)
/*! @} */

/*! @name NCO32K_STAT - NCO32k status */
/*! @{ */

#define RADIO_CTRL_NCO32K_STAT_FSM_STATE_MASK    (0x7U)
#define RADIO_CTRL_NCO32K_STAT_FSM_STATE_SHIFT   (0U)
/*! FSM_STATE - NCO32k FSM State */
#define RADIO_CTRL_NCO32K_STAT_FSM_STATE(x)      (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_STAT_FSM_STATE_SHIFT)) & RADIO_CTRL_NCO32K_STAT_FSM_STATE_MASK)

#define RADIO_CTRL_NCO32K_STAT_MUX_STATE_MASK    (0x10U)
#define RADIO_CTRL_NCO32K_STAT_MUX_STATE_SHIFT   (4U)
/*! MUX_STATE - NCO32K Mux state */
#define RADIO_CTRL_NCO32K_STAT_MUX_STATE(x)      (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_STAT_MUX_STATE_SHIFT)) & RADIO_CTRL_NCO32K_STAT_MUX_STATE_MASK)

#define RADIO_CTRL_NCO32K_STAT_PHASE_DELTA_MASK  (0xFF00U)
#define RADIO_CTRL_NCO32K_STAT_PHASE_DELTA_SHIFT (8U)
/*! PHASE_DELTA - Relative phase between 32k768 reference and NCO32k output */
#define RADIO_CTRL_NCO32K_STAT_PHASE_DELTA(x)    (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_STAT_PHASE_DELTA_SHIFT)) & RADIO_CTRL_NCO32K_STAT_PHASE_DELTA_MASK)

#define RADIO_CTRL_NCO32K_STAT_PHASE_CORRECTION_MASK (0xFF0000U)
#define RADIO_CTRL_NCO32K_STAT_PHASE_CORRECTION_SHIFT (16U)
/*! PHASE_CORRECTION - Phase difference between FRO32K and internaly generated clock. */
#define RADIO_CTRL_NCO32K_STAT_PHASE_CORRECTION(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_NCO32K_STAT_PHASE_CORRECTION_SHIFT)) & RADIO_CTRL_NCO32K_STAT_PHASE_CORRECTION_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RADIO_CTRL_Register_Masks */


/*!
 * @}
 */ /* end of group RADIO_CTRL_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_RADIO_CTRL_H_ */

